Sandia_D/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Do a synchronisation of coupled points after creation of any patches.
// Note: this does not work with points that are on multiple coupled patches
//       with transformations (i.e. cyclics).
pointSync false;

// Optional: Write cyclic matches into .obj format; defaults to false.
writeCyclicMatch  false;

patches
(
    {
        name inletJet;
        patchInfo
        {
            type patch;
        }
        constructFrom set;
        set faceSetJet;
    }

    {
        name inletPilot;
        patchInfo
        {
            type patch;
        }
        constructFrom set;
        set faceSetPilot;
    }

    {
        name inletAir;
        patchInfo
        {
            type patch;
        }
        constructFrom set;
        set faceSetAir;
    }

);

// ************************************************************************* //
