Sandia_D/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    inletJet
    {
        type            zeroGradient;
    }

    inletPilot
    {
        type            zeroGradient;
    }

    inletAir
    {
        type            zeroGradient;
    }

    wallInlet
    {
        type            zeroGradient;
    }

    wallOutside
    {
        type            zeroGradient;
    }

    outlet
    {
        type            waveTransmissive;
        value           uniform 100000;    //important for correct I/O
        field           p;                //the name of the field that we are working on
        gamma           1.3;              //the ratio of specific heats
        phi             phi;             //the name of the volumetric flux field ( or if you use the mass flux phi, it will be divided by rho)
        rho             rho;              //the name of the density field
        psi             thermo:psi;              //the name of the field that is the deriv. of density with respect to pressure
        lInf            1.0;             //a measure of how far away the far-field condition should be
        fieldInf        100000;            //the far-field value to be applied to p
    }
}

// ************************************************************************* //
