Sandia_D/0.orig/CO
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           volScalarField;
    location        "0";
    object          CO;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    inletJet
    {
        type            fixedValue;
        value           uniform 0;
    }
    inletPilot
    {
        type            fixedValue;
        value           uniform 0.00407;
    }
    inletAir
    {
        type            fixedValue;
        value           uniform 0;
    }
    wallInlet
    {
        type            fixedValue;
        value           uniform 0.00407;
    }
    wallOutside
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
