Sandia_D/0.orig/O2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           volScalarField;
    location        "0";
    object          O2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 0 0 0 0 ];

internalField   uniform 0.23;

boundaryField
{
    inletJet
    {
        type            fixedValue;
        value           uniform 0.1966;
    }
    inletPilot
    {
        type            fixedValue;
        value           uniform 0.054;
    }
    inletAir
    {
        type            fixedValue;
        value           uniform 0.23;
    }
    wallInlet
    {
        type            fixedValue;
        value           uniform 0.054;
    }
    wallOutside
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
