Sandia_D/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField uniform 310; //291;

boundaryField
{
    inletJet
    {
        type            fixedValue;
        value           uniform 310; //294;
    }

    inletPilot
    {
        type            fixedValue;
        value           uniform 1880;
    }

    inletAir
    {
        type            fixedValue;
        value           uniform 310; //291;
    }

    wallInlet
    {
        type            fixedValue;
        value           uniform 310; //294;
    }

    wallOutside
    {
        type            zeroGradient;
    }

    outlet
    {
        type            zeroGradient; // inletOutlet;
    }
}

// ************************************************************************* //
