Sandia_D/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(

    {
        name           faceSetJet;
        type           faceSet;
        action         new;

        source         cylinderToFace;
        sourceInfo
        {
            p1             (-0.00001 0 0);
            p2             ( 0.00001 0 0);
            radius         0.0036;
        }
    }

    {
        name           faceSetPilot;
        type           faceSet;
        action         new;

        source         cylinderAnnulusToFace;
        sourceInfo
        {
            p1             (-0.00001 0 0);
            p2             ( 0.00001 0 0);
            innerRadius    0.00385;
            outerRadius    0.0091;
        }
    }

    {
        name           faceSetAir;
        type           faceSet;
        action         new;

        source         cylinderAnnulusToFace;
        sourceInfo
        {
            p1             (-0.00001 0 0);
            p2             ( 0.00001 0 0);
            innerRadius    0.00945;
            outerRadius    0.25;
        }
    }

);

// ************************************************************************* //
